bg8wj/gizwit-stm32f407/Gizwits/gizwits_product.h
/**
************************************************************
* @file         gizwits_product.h
* @brief        Corresponding gizwits_product.c header file (including product hardware and software version definition)
* @author       Gizwits
* @date         2017-07-19
* @version      V03030000
* @copyright    Gizwits
* 
* @note         机智云.只为智能硬件而生
*               Gizwits Smart Cloud  for Smart Products
*               链接|增值ֵ|开放|中立|安全|自有|自由|生态
*               www.gizwits.com
*
***********************************************************/
#ifndef _GIZWITS_PRODUCT_H
#define _GIZWITS_PRODUCT_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>
#include "stm32f4xx.h"
#include "gizwits_protocol.h"

/**
* MCU software version
*/
#define SOFTWARE_VERSION "03030000"
/**
* MCU hardware version
*/
#define HARDWARE_VERSION "03010100"


/**
* Communication module model
*/
#define MODULE_TYPE 0 //0,WIFI ;1,GPRS


/**@name TIM3 related macro definition
* @{
*/
#define TIMER 					TIM3
#define TIMER_IRQ 				TIM3_IRQn
#define TIMER_RCC 				RCC_APB1Periph_TIM3
#define TIMER_IRQ_FUN 			TIM3_IRQHandler
/**@} */

/**@name USART related macro definition
* @{
*/
#define UART_BAUDRATE 			9600
#define UART_PORT     			3
#define UART          			USART3
#define UART_IRQ      			USART3_IRQn
#define UART_IRQ_FUN  			USART3_IRQHandler


#if (UART_PORT == 1)
#define UART_GPIO_Cmd          RCC_AHB1PeriphClockCmd
#define UART_GPIO_CLK          RCC_AHB1Periph_GPIOA

#define UART_AFIO_Cfg          GPIO_PinAFConfig
#define UART_AFIO_Per          GPIO_AF_USART1
#define UART_AFIO_Sour1        GPIO_PinSource9
#define UART_AFIO_Sour2        GPIO_PinSource10

#define UART_CLK_Cmd           RCC_APB2PeriphClockCmd
#define UART_CLK               RCC_APB2Periph_USART1 

#define UART_GPIO_PORT         GPIOA
#define UART_RxPin             GPIO_Pin_10
#define UART_TxPin             GPIO_Pin_9
#endif

#if (UART_PORT == 2)
#define UART_GPIO_Cmd          RCC_AHB1PeriphClockCmd
#define UART_GPIO_CLK          RCC_AHB1Periph_GPIOA

#define UART_AFIO_Cfg          GPIO_PinAFConfig
#define UART_AFIO_Per          GPIO_AF_USART2
#define UART_AFIO_Sour1        GPIO_PinSource2
#define UART_AFIO_Sour2        GPIO_PinSource3

#define UART_CLK_Cmd           RCC_APB1PeriphClockCmd
#define UART_CLK               RCC_APB1Periph_USART2 

#define UART_GPIO_PORT         GPIOA
#define UART_RxPin             GPIO_Pin_3
#define UART_TxPin             GPIO_Pin_2
#endif

#if (UART_PORT == 3)

#define UART_GPIO_Cmd          RCC_AHB1PeriphClockCmd
#define UART_GPIO_CLK          RCC_AHB1Periph_GPIOB

#define UART_AFIO_Cfg          GPIO_PinAFConfig
#define UART_AFIO_Per          GPIO_AF_USART3
#define UART_AFIO_Sour1        GPIO_PinSource10
#define UART_AFIO_Sour2        GPIO_PinSource11

#define UART_CLK_Cmd           RCC_APB1PeriphClockCmd
#define UART_CLK               RCC_APB1Periph_USART3 

#define UART_GPIO_PORT         GPIOB
#define UART_RxPin             GPIO_Pin_11
#define UART_TxPin             GPIO_Pin_10



#endif
/**@} */

/** User area the current device state structure*/
extern dataPoint_t currentDataPoint;

void timerInit(void);
void uartInit(void);
void userInit(void);
void userHandle(void);
void mcuRestart(void);
int32_t uartWrite(uint8_t *buf, uint32_t len);
int8_t gizwitsEventProcess(eventInfo_t *info, uint8_t *data, uint32_t len);

#ifdef __cplusplus
}
#endif

#endif
